//橫列 直欄
map_no[0] = {
    "pass_code" : "095PS",
    //0 => 第1欄 image_back_ground
    "back_ground" : 0,
    //start and end [x,y,h] | route [x,y,w,h,dir]
    "route" : {
        "start" : [0,5,3],
        "road"  : [[0,5,52,3,2],[52,5,2,10,0],[10,15,44,3,1],[8,15,2,10,0],[8,25,56,3,2]],
        "end"   : [62,25,3],
    },
    //每波敵人
    "enemy" : [
        //數量,產生間隔,圖片,生命,速度,掉落金錢 (產生間隔要速度的兩倍以上)
        [10,10,"image_enemy_01",300,5,15],
        [10,20,"image_enemy_02",400,5,15],
    ]
}

map_no[1] = {
    "pass_code" : "0DM06",
    "back_ground" : 1,
    "route" : {
        "start" : [0,5,3],
        "road"  : [[0,5,52,3,2],[52,5,2,10,0],[10,15,44,3,1],[8,15,2,10,0],[8,25,56,3,2]],
        "end"   : [62,25,3],
    },
    "enemy" : [
        [10,20,"image_enemy_02",100,10,15],
    ]
}