stage[0] = {
    //通關碼
    "stage_code" : "095PS",
    //初始生命
    'life' : 10,
    //初始金錢
    'money' : 100,
    //image_back_ground [X開始座標,Y開始座標,寬 X=>X',高 Y=>Y']
    "back_ground" : [0,0,32,32],
    //敵人出現位置 [X座標,Y座標]
    "road_start" : [0,5,2,3],
    //敵人路線 [X開始座標,Y開始座標,寬 X=>X',高 Y=>Y',行走方向 dir]
    "road" :  [[0,5,52,3,2],[52,5,2,10,0],[10,15,44,3,1],[8,15,2,10,0],[8,25,56,3,2]],
    //敵人結束位置 [X座標,Y座標]
    "road_end"   : [62,25,2,3],
    //每波敵人
    "enemy" : [
        //數量,產生間隔(產生間隔要速度的兩倍以上),圖片,生命,速度(值越大越慢),掉落金錢
        [10,30,"image_enemy_01",50,10,10],
        [10,20,"image_enemy_02",60,10,15],
        [5,30,"image_enemy_01",160,10,20],
        [10,20,"image_enemy_02",50,5,15],
        [5,30,"image_enemy_11",300,10,25],
        [5,60,"image_enemy_03",600,20,30],
        [1,30,"image_enemy_04",1500,20,30],
    ]
}

stage[1] = {
    "stage_code" : "0DM06",
    'life' : 10,
    'money' : 100,
    "back_ground" : [0,0,32,32],
    "road_start" : [0,13,2,3],
    "road" :  [[0,13,16,3,2],[16,13,2,12,0],[16,25,24,3,2],[40,8,2,20,3],[40,5,24,3,2]],
    "road_end"   : [62,5,2,3],
    "enemy" : [
        [20,20,"image_enemy_03",50,10,10],
        [10,20,"image_enemy_20",60,10,15],
        [10,30,"image_enemy_05",160,10,20],
        [10,20,"image_enemy_03",50,5,15],
        [5,30,"image_enemy_03",300,10,25],
        [5,60,"image_enemy_05",600,20,30],
        [1,30,"image_enemy_06",1500,30,30],
        [1,30,"image_enemy_04",1000,5,30],
    ]
}

stage[2] = {
    "stage_code" : "0UUOE",
    'life' : 10,
    'money' : 100,
    "back_ground" : [0,0,32,32],
    "road_start" : [34,0,2,3],
    "road" :  [[34,0,2,10,0],[8,10,28,3,1],[6,10,2,15,0],[6,25,35,3,2],[41,10,2,18,3],[41,7,23,3,2]],
    "road_end"   : [62,7,2,3],
    "enemy" : [
        [10,20,"image_enemy_01",100,10,10],
        [10,20,"image_enemy_02",150,10,15],
        [10,30,"image_enemy_03",200,10,20],
        [10,24,"image_enemy_04",300,8,15],
        [10,30,"image_enemy_15",100,5,25],
        [10,20,"image_enemy_16",250,5,30],
        [30,10,"image_enemy_07",50,1,10],
        [10,30,"image_enemy_08",2000,5,30],
        [10,30,"image_enemy_02",3000,5,30],
        [1,30,"image_enemy_08",5000,5,30],
    ]
}

stage[3] = {
    "stage_code" : "15WKR",
    'life' : 10,
    'money' : 200,
    "back_ground" : [32,0,32,32],
    "road_start" : [0,13,2,3],
    "road" :  [[0,13,16,3,2],[16,13,2,12,0],[16,25,40,3,2],[56,8,2,20,3],[0,5,58,3,1]],
    "road_end"   : [0,5,2,3],
    "enemy" : [
        [10,30,"image_enemy_05",50,10,10],
        [10,20,"image_enemy_06",60,5,15],
        [5,30,"image_enemy_07",160,10,20],
        [10,20,"image_enemy_08",190,15,10],
        [10,30,"image_enemy_09",300,10,25],
        [5,60,"image_enemy_10",600,20,30],
        [5,30,"image_enemy_11",1500,30,30],
        [1,30,"image_enemy_15",1000,10,30],
    ]
}

stage[4] = {
    "stage_code" : "1JGRU",
    'life' : 10,
    'money' : 200,
    "back_ground" : [32,0,32,32],
    "road_start" : [0,14,2,3],
    "road" :  [[0,14,64,3,2],],
    "road_end"   : [62,14,2,3],
    "enemy" : [
        [20,20,"image_enemy_08",50,10,10],
        [10,20,"image_enemy_06",60,10,15],
        [10,30,"image_enemy_07",160,10,20],
        [20,20,"image_enemy_06",50,10,15],
        [5,30,"image_enemy_16",300,10,25],
        [5,60,"image_enemy_12",600,20,30],
        [1,30,"image_enemy_13",1500,30,30],
        [1,30,"image_enemy_14",1000,5,30],
    ]
}

stage[5] = {
    "stage_code" : "1XFM9",
    'life' : 10,
    'money' : 200,
    "back_ground" : [32,0,32,32],
    "road_start" : [0,10,2,3],
    "road" :  [[0,10,20,3,2],[20,10,2,15,0],[20,25,20,3,2],[40,8,2,20,3],[40,5,18,3,2],[58,5,2,27,0]],
    "road_end"   : [58,29,2,3],
    "enemy" : [
        [10,20,"image_enemy_11",100,10,10],
        [10,20,"image_enemy_12",150,10,15],
        [10,30,"image_enemy_13",200,10,20],
        [10,24,"image_enemy_19",300,8,15],
        [10,30,"image_enemy_15",100,5,25],
        [10,20,"image_enemy_16",250,5,30],
        [30,10,"image_enemy_17",50,1,10],
        [10,30,"image_enemy_18",2000,5,30],
        [10,30,"image_enemy_19",3000,5,30],
        [1,30,"image_enemy_20",5000,5,30],
    ]
}

stage[6] = {
    "stage_code" : "28R9N",
    'life' : 10,
    'money' : 300,
    "back_ground" : [64,0,32,32],
    "road_start" : [0,5,2,3],
    "road" :  [[0,5,30,3,2],[30,5,2,19,0],[30,24,34,3,2]],
    "road_end"   : [62,24,2,3],
    "enemy" : [
        [10,20,"image_enemy_01",100,10,10],
        [10,20,"image_enemy_02",150,10,15],
        [10,30,"image_enemy_03",200,10,20],
        [10,24,"image_enemy_04",300,8,15],
        [10,30,"image_enemy_05",100,5,25],
        [10,20,"image_enemy_06",250,5,30],
        [30,10,"image_enemy_07",50,1,10],
        [10,30,"image_enemy_08",2000,5,30],
        [10,30,"image_enemy_02",3000,5,30],
        [1,30,"image_enemy_08",5000,5,30],
    ]
}

stage[7] = {
    "stage_code" : "2PRXX",
    'life' : 10,
    'money' : 300,
    "back_ground" : [64,0,32,32],
    "road_start" : [0,24,2,3],
    "road" :  [[0,24,52,3,2],[52,17,2,10,3],[10,14,44,3,1],[8,6,2,11,3],[8,3,56,3,2]],
    "road_end"   : [62,3,2,3],
    "enemy" : [
        [10,20,"image_enemy_01",100,10,10],
        [10,20,"image_enemy_02",150,10,15],
        [10,30,"image_enemy_03",200,10,20],
        [10,24,"image_enemy_04",300,8,15],
        [10,30,"image_enemy_05",100,5,25],
        [10,20,"image_enemy_06",250,5,30],
        [30,10,"image_enemy_07",50,1,10],
        [10,30,"image_enemy_08",2000,5,30],
        [10,30,"image_enemy_02",3000,5,30],
        [1,30,"image_enemy_08",5000,5,30],
    ]
}

stage[8] = {
    "stage_code" : "2WA0T",
    'life' : 10,
    'money' : 9999,
    "back_ground" : [64,0,32,32],
    "road_start" : [0,5,2,3],
    "road" :  [[0,5,10,3,2],[10,5,2,10,0],[10,15,30,3,2],[40,8,2,10,3],[40,5,18,3,2],[58,5,2,20,0],[0,25,60,3,1]],
    "road_end"   : [0,25,2,3],
    "enemy" : [
        [20,60,"image_enemy_01",1000,15,1],
        [20,60,"image_enemy_03",2000,15,1],
        [20,60,"image_enemy_04",3060,15,1],
        [20,60,"image_enemy_05",4000,15,1],
        [15,60,"image_enemy_06",5000,20,1],
        [15,60,"image_enemy_07",6000,20,1],
        [15,60,"image_enemy_08",7000,20,1],
        [15,60,"image_enemy_09",8000,20,1],
        [15,60,"image_enemy_10",9000,20,1],
        [10,60,"image_enemy_11",10000,20,1],
        [10,60,"image_enemy_12",11000,20,1],
        [10,60,"image_enemy_13",12000,20,1],
        [10,60,"image_enemy_14",13000,20,1],
        [8,60,"image_enemy_15",14000,20,1],
        [8,60,"image_enemy_16",15000,20,1],
        [8,60,"image_enemy_17",16000,20,1],
        [8,60,"image_enemy_18",17000,20,1],
        [8,60,"image_enemy_19",18000,20,1],
        [5,60,"image_enemy_20",20000,20,1],
    ]
}